package com.example.cloud.company.common.constants;

/**
 * 提示信息常量
 * @Description:
 * @Company: 税友软件集团股份有限公司
 * @author: tts
 * @date: 2017/4/18 13:31
 */
public class SbxxtsConstants {

    /***
     *     申报所属期起 所属期止  的时间格式
     */
    public static  final String TIME_TYPE_YYYYMMDD = "yyyyMMdd";

    /***
     *     小规模票表数据调华云接口提示信息
     *     接口数据正在加工，需要纳税人等待一段时间
     */
    public static  final String SUCCESS = "华云返回数据成功!";

    /***
     *     小规模票表数据调华云接口提示信息
     *     接口数据正在加工，需要纳税人等待一段时间
     */
//    public static final String WAIT_15_MINUTE = "数据加工中,请15分钟后再查询!";
    public static final String WAIT_15_MINUTE = "尊敬的小规模纳税人，因您刚完成增值税发票开票系统的抄报税，系统正在汇总您开具的发票数据。为让您应享尽享小微纳税人相关优惠政策，请等待15分钟。您在系统完成发票数据的汇总后再申报，系统将辅助你填写申报表。\n" +
            "    您也可以选择“继续申报”，如继续申报请根据实际经营情况如实填写申报表。";

    /***
     *     小规模票表数据调华云接口提示信息
     *     系统级异常或者系统返回该属期无数据
     */
//    public static final String CALL_FOR_HELP = "尊敬的纳税人,由于系统未获取到申报所属期的发票数据," +
//            "请等待30分钟后重试。如仍提示本错误,请第二天再试。重试后仍无法获取发票数据," +
//            "请联系主管税务机关提交后台处理。如申报期最后一天出现上述提示,请径直联系主管税务机关处理。" +
//            "给您带来的不便我局深表歉意!";
    public static final String CALL_FOR_HELP = "尊敬的纳税人，因系统异常暂未获取到申报所属期的发票数据。为让您应享尽享小微纳税人相关优惠政策，请联系主管税务机关提交后台处理（如不是征期最后一天可以第二天再试）。给您带来的不便我局深表歉意！\n" +
            "    您也可以选择“继续申报”，如继续申报请根据实际经营情况如实填写申报表。";

    /***
     *     小规模票表数据调华云接口提示信息
     *     未抄税
     */
    public static final String NOT_CHAO_SHUI = "尊敬的纳税人，你未完成当前所属期的增值税防伪税控抄报税，你应在本申报所属期的每一个月均完成增值税防伪税控抄报税。" +
            "例如：当前申报2019年2季度，你应该在分别在5月、6月、7月完成抄报税。如你没有在每一个月按时完成抄报税，请到主管税务机关前台处理!";

    /***
     * 发票2.0系统异常
     */
    public static final String SKXT_SYSTEM_ERREO = "尊敬的纳税人，因系统调用增值税发票管理系统接口异常，请稍后重试，给您带来的不便我局深表歉意！如非申报期最后一天，您可以第二天再试，也可以联系主管税务机关提交后台处理。";
}

